site.org
#+STARTUP: content
#+AUTHOR: Ben Ford
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
** Who Am I?
:PROPERTIES:
:EXPORT_FILE_NAME: me
:EXPORT_HUGO_WEIGHT: 10
:END:

Brand and values

<!--more-->

*** What do I do?

I have a unique background (pretty much). I don't know of anyone else who's had
elite military experience and then gone on to have a career is technology and
programming (at least on the implementation side). I've also had a life long
interest in studying psychology and high performance. I want to apply these 3
aspects to helping tech companies build the best teams possible.

{{% blockquote title="Positioning Statement" %}}

 I help early stage tech companies navigate the phase shift from start up to
 established company. Having built and led teams in all sizes of company and
 leaning on experience of elite military operations from my time in the Royal
 Marine Commandos I will show you how to implement standards without stifling
 your essence. Operational excellence is the fuel you must have to propel you to
 the next level, I can help get you there.
{{% /blockquote %}}

*** How do I do it?
I will offer a transformation based around the core principle of helping
understand their feedback loops at all levels of the company and how to optimise
them. At the end of my engagement companies will have effective development
teams that are aligned with the mission and purpose of the company and
operationally set up for repeatable high performance. They will have an
operating manual which serves many purposes:

- A living record of the way things are done
- A set of instructions for existing staff
- An onboarding aim for new hires
- A record of the company's culture and values
*** What's my point of difference
I have several major points of difference:

**** Military background
This gives me a very unusual perspective compared to the vast majority of people
in tech.
**** Self taught
I am self directed and motivated (and learning to code on a warship is a cool story)
**** Leadership and team building experience
I've walked the walk both at start ups and established companies.
**** Broad background knowledge and intuition
I've read probably 500 or so books on leadership/development/military theory, and
I've made links between all of these to come up with a simple focus on
principles which I think is pretty unique
*** Who am I doing this for?
In the first instance I'm doing this for my customers. But I have an eye on
being able to give back and pay it forward for lads that come after me, or those
that haven't been as lucky as me.
**** Ideal customers
My ideal customer is a growing software or technology company which is
navigating the inevitable social inflection points that a growing team hits.

I'm looking for companies that are at the 30 ish or 100-150 ish people phase
shifts. It's at these point where there is a shift to more or different process
and I want to position myself to mentor the company or tech leadership to
successfully navigate this change.

The company should have a clear mission and purpose (or at least stand a chance
of defining that) and should want to be in the cutting edge of innovation and
learning. They are most probably a start up growing into an established company
but experiencing some growing pains getting there.

Operational Excellence should put the company in the exceptional quadrant on all
the metrics that matter from Accelerate (a book about devops with a very
quantitative approach) and will ensure that they can out manoeuvre their
competition and the market incumbents.

The engagement will most likely look like an intensive period of transformation
during which the implementation plan is formulated and I ensure that the company
has the tools and aptitude to succeed. Once they have that I will scale down to
an advisory and mentoring role and look at a retainer going forward.

Outcomes for the company will be a more agile, able team that is fully aligned
with the missing and able to execute efficiently to give the company the
greatest possible chance of shaping and adapting to unfolding circumstances and
surviving on their own terms.
**** People leaving the forces
When people (especially enlisted) leave the forces they still aren't getting
good information. I would like to be able to take any success I have from this
venture and help show people leaving the forces just how fundamental the skills
and experiences they have had are.

**** Military Charities
I also want to be successful enough that I can comfortably give some percentage
of my time and earnings to charities/causes who are helping those that haven't
had it so easy. For example Rock2Recovery and others doing great work.
*** Values
Courage, Determination, Unselfishness, Cheerfulness in the face of adversity,
Humility, Excellence, Integrity. All of these are relevant from our time in the
corps. Some other values I've picked up along the way:

*Elegance* - spend a bit more effort to find a solution that is unforced and
natural.

*Structure* - find the right amount to be supportive, not stifling.

*Fundamental* - keep deconstructing until you have reached something
irreducible.

*Kaizen* - always be learning and improving.

*Detachment* - take the world as it is, not as you wish it was.

*** Personality
The personality of Commando Development should in many ways reflect that of the
corps.

*Confidence* tempered with humility: We know what we can do, but we know how much
more there is to learn.

*Precicision* We strive for clarity and succinctness.

*Sharp* and focused

*Wry sense of humor* We don't take ourselves too seriously

*Unflappable* We deal with whatever comes our way calmly


